tap "common-fate/granted"

cask "bambu-studio"
cask "discord"
cask "drawio"
cask "emacs"
cask "firefox"
cask "font-consolas-for-powerline"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-geist"
cask "ghostty"
cask "lm-studio"
cask "obsidian"
cask "rectangle"
cask "visual-studio-code"

brew "aws-vault"
brew "awscli"
brew "bat"
brew "colima"
brew "coreutils"
brew "cowsay"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-absorb"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "golang"
brew "granted"
brew "graphviz"
brew "gum"
brew "htop"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "npm"
brew "openssl@3"
brew "powerlevel10k"
brew "pre-commit"
brew "readline"
brew "ripgrep-all"
brew "shellcheck"
brew "sqlfluff"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "xz"
brew "zinit"
brew "zlib"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh"

vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.vscode-yaml"
