tap "homebrew/bundle"

cask "alacritty"
cask "docker"
cask "iterm2"
cask "kitty"
cask "obsidian"
cask "rectangle"
cask "visual-studio-code"

brew "aws-vault"
brew "awscli"
brew "bat"
brew "coreutils"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "git-open"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "ollama"
brew "openssl@3"
brew "pipx"
brew "pyenv-virtualenv"
brew "pyenv"
brew "readline"
brew "ripgrep-all"
brew "rust"
brew "sqlite"
brew "tree"
brew "uv"
brew "xz"
brew "zlib"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh"

vscode "continue.continue"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.vscode-yaml"
